app/views/songs/show.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---

<% if @song.artist.blank? %>