app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_artist
    @artist = Artist.find_by(id: params[:id])